[
  {
    "name": "Anbe Sivam",
    "clues": [
      "Cynical hero and compassionate stranger's journey fosters profound understanding of love.",
      "The compassionate stranger narrates his life story on a train.",
      "\"Sarvam Sivamayam... Idhu kaadhalin nalam, aanal dhayaiyin payanam.\"",
      "Sundar C.",
      "Kamal Haasan, Madhavan, Kiran Rathod"
    ]
  },
  {
    "name": "Vada Chennai",
    "clues": [
      "Innocent carrom player drawn into brutal North Chennai gang underworld.",
      "Gritty opening sequence establishes the ruthless North Chennai underworld.",
      "\"Semma, idhu unga area, nee dhan king-u.\"",
      "Vetrimaaran",
      "Dhanush, Ameer, Andrea Jeremiah, Aishwarya Rajesh"
    ]
  },
  {
    "name": "Kaakha Kaakha",
    "clues": [
      "Dedicated police officer's relentless pursuit of drug lord leads to tragedy.",
      "The officer confronts the villain after his team is ambushed.",
      "\"Naan unga police, enna senjaalum, en duty mudiyum varaikum.\"",
      "Gautham Vasudev Menon",
      "Suriya, Jyothika, Jeevan"
    ]
  },
  {
    "name": "Muthu",
    "clues": [
      "Loyal servant in love triangle faces revelations, challenging his identity.",
      "The iconic introduction scene of the hero dancing in the village.",
      "\"Naan oru thadava sonna, nooru thadava sonna maadhiri.\"",
      "K. S. Ravikumar",
      "Rajinikanth, Meena, Sarath Babu"
    ]
  },
  {
    "name": "Nayagan",
    "clues": [
      "Young boy flees, rises to powerful don, fighting for the poor.",
      "The don confronts the police inspector asserting his authority.",
      "\"Neenga nallavara kettavara?\"",
      "Mani Ratnam",
      "Kamal Haasan, Saranya Ponvannan, Karthika"
    ]
  },
  {
    "name": "Enthiran",
    "clues": [
      "Scientist's robot develops emotions, turns rogue, threatening mankind.",
      "The robot multiplies into giant shapes in the spectacular climax.",
      "\"Happy birthday to me... Happy birthday to me...\"",
      "S. Shankar",
      "Rajinikanth, Aishwarya Rai Bachchan, Danny Denzongpa"
    ]
  },
  {
    "name": "Pariyerum Perumal",
    "clues": [
      "Law student from marginalized community fights relentless caste discrimination.",
      "The hero is humiliated in front of classmates, highlighting prejudice.",
      "\"Naanga ellorum onnu dhan. Jaathi nu edhum illa.\"",
      "Mari Selvaraj",
      "Kathir, Anandhi, Yogi Babu"
    ]
  },
  {
    "name": "Ghilli",
    "clues": [
      "Kabaddi player helps girl escape ruthless gang leader; thrilling chase ensues.",
      "The iconic climax kabaddi match where the hero wins.",
      "\"Adichu thooku da!\"",
      "Dharani",
      "Vijay, Trisha Krishnan, Prakash Raj"
    ]
  },
  {
    "name": "Maaran",
    "clues": [
      "Principled journalist uncovers conspiracy, risking family for truth and justice.",
      "The hero's family is targeted by the corrupt politician's henchmen.",
      "\"U உண்மையை வெளிய கொண்டு vara, uyiraiyum kuduppen.\"",
      "Karthick Naren",
      "Dhanush, Malavika Mohanan, Samuthirakani"
    ]
  },
  {
    "name": "Thuppakki",
    "clues": [
      "Army officer uncovers sleeper cell network, neutralizes terrorists strategically.",
      "The brilliant 'silent' interrogation scene identifying sleeper cell members.",
      "\"I am a soldier, I don't care about the consequences.\"",
      "AR Murugadoss",
      "Vijay, Kajal Aggarwal, Vidyut Jammwal"
    ]
  },
  {
    "name": "Virumaandi",
    "clues": [
      "Death row inmates recount conflicting stories, questioning truth and justice.",
      "The intense 'Jallikattu' scene, central to the hero's backstory.",
      "\"Appan illadha pillai, aaram thumbi adangudhu.\"",
      "Kamal Haasan",
      "Kamal Haasan, Abhirami, Pasupathy"
    ]
  },
  {
    "name": "Asuran",
    "clues": [
      "Landless farmer protects family from landlord, fighting oppression and injustice.",
      "The harrowing climax where the father makes a difficult choice.",
      "\"Naanga porandha idathula, naanga saavadichum vaazhuvom.\"",
      "Vetrimaaran",
      "Dhanush, Manju Warrier, Ken Karunas"
    ]
  },
  {
    "name": "Kadhalikka Neramillai",
    "clues": [
      "Friends use schemes, impersonations to win lovers; hilarious misunderstandings ensue.",
      "Nagesh narrates a hilarious fake ghost story, iconic comedy scene.",
      "\"Avan yaaru? Avan namma Mappillai.\"",
      "C. V. Sridhar",
      "Muthuraman, Nagesh, Kanchana, Rajasree"
    ]
  },
  {
    "name": "Padayappa",
    "clues": [
      "Principled man faces betrayal from rival, fighting for family and integrity.",
      "The epic confrontation between the hero and the villainess.",
      "\"En vazhi thani vazhi.\"",
      "K. S. Ravikumar",
      "Rajinikanth, Soundarya, Ramya Krishnan"
    ]
  },
  {
    "name": "Vikram Vedha",
    "clues": [
      "Police officer hunts gangster, who narrates moral dilemmas, blurring lines.",
      "The climactic face-off where the villain presents his final dilemma.",
      "\"Oru kadha sollatuma, sir?\"",
      "Pushkar–Gayathri",
      "R. Madhavan, Vijay Sethupathi, Shraddha Srinath"
    ]
  },
  {
    "name": "Roja",
    "clues": [
      "Woman searches for kidnapped husband in Kashmir; human cost of conflict.",
      "The heroine's emotional appeal for her husband's release.",
      "\"India is a country where there is freedom.\"",
      "Mani Ratnam",
      "Arvind Swami, Madhoo, Nassar"
    ]
  },
  {
    "name": "Thani Oruvan",
    "clues": [
      "Brilliant officer exposes intelligent antagonist's criminal network; cunning battle of wits.",
      "The hero deduces the villain's true nature, begins intricate plan.",
      "\"Neenga yevan nalla, yaaru kettavan nu kandupudikka mudiyala.\"",
      "Mohan Raja",
      "Jayam Ravi, Arvind Swami, Nayanthara"
    ]
  },
  {
    "name": "Kaththi",
    "clues": [
      "Criminal switches places with activist, fighting corporate giant for farmers.",
      "The hero delivers a passionate speech about farmers' plight.",
      "\"Oru Gramathoda uyir, oru ooraalunga valkai, edha ninaichalum.\"",
      "AR Murugadoss",
      "Vijay, Samantha Ruth Prabhu, Neil Nitin Mukesh"
    ]
  },
  {
    "name": "Mouna Ragam",
    "clues": [
      "Woman with past heartbreak struggles to accept arranged marriage husband.",
      "The heroine confesses her past, leading to a turning point.",
      "\"I like you... I like you a lot.\"",
      "Mani Ratnam",
      "Mohan, Revathi, Karthik"
    ]
  },
  {
    "name": "Petta",
    "clues": [
      "Enigmatic hostel warden with mysterious past protects students from gangster.",
      "The stylish, action-packed introduction scene of the charismatic warden.",
      "\"Peru Kaali... Uruku naan thaan king.\"",
      "Karthik Subbaraj",
      "Rajinikanth, Vijay Sethupathi, Nawazuddin Siddiqui, Simran, Trisha"
    ]
  },
  {
    "name": "Bombay",
    "clues": [
      "Interfaith couple caught in communal riots; fight for family's safety.",
      "The couple frantically searches for lost children amidst riots.",
      "\"Indha ooru ennoda uyir... idhu unga ooru illa.\"",
      "Mani Ratnam",
      "Arvind Swami, Manisha Koirala"
    ]
  },
  {
    "name": "Dheena",
    "clues": [
      "Hot-headed young man navigates underworld, faces betrayal, finds destiny.",
      "The intense fight scene where the hero takes on thugs.",
      "\"Vazhiyila enga venumnaalum nillu, aanal enna paththi mattum ninaikatha.\"",
      "A. R. Murugadoss",
      "Ajith Kumar, Laila, Suresh Gopi"
    ]
  },
  {
    "name": "Aayutha Ezhuthu",
    "clues": [
      "Three men's lives converge during political rally; fate changes.",
      "The pivotal central scene of the triple shooting on the bridge.",
      "\"Idhu oru puthiya satham... indha satham nammaloda satham.\"",
      "Mani Ratnam",
      "Suriya, R. Madhavan, Siddharth, Trisha Krishnan, Esha Deol, Meera Jasmine"
    ]
  },
  {
    "name": "Nanban",
    "clues": [
      "Engineering students challenge education system, find passions through friendship.",
      "The iconic 'all izz well' scene during difficult times.",
      "\"All is well!\"",
      "S. Shankar",
      "Vijay, Jiiva, Srikanth, Ileana D'Cruz"
    ]
  },
  {
    "name": "Vettaiyaadu Vilaiyaadu",
    "clues": [
      "Relentless police officer hunts serial killer in New York, confronts demons.",
      "The chilling scene where the officer confronts the serial killer.",
      "\"Unakkum enakkum oru kozhappam dhan. Yaaru yaarukku porutham nu theriyala.\"",
      "Gautham Vasudev Menon",
      "Kamal Haasan, Jyothika, Daniel Balaji"
    ]
  },
  {
    "name": "Pithamagan",
    "clues": [
      "Man raised in graveyard finds bond, then faces raw vengeance.",
      "The heartbreaking climax where the hero cries for the first time.",
      "\"Vazhkai oru vattam... seththavanuku vazhkai illai.\"",
      "Bala",
      "Vikram, Suriya, Laila, Sangeetha"
    ]
  },
  {
    "name": "Rajapattai",
    "clues": [
      "Bodybuilder aspiring to actor fights corrupt politician for common people.",
      "The high-octane action sequence showcasing the hero's strength.",
      "\"Thirumbi vanthutan da!\"",
      "Suseenthiran",
      "Vikram, Deeksha Seth, K. Vishwanath"
    ]
  },
  {
    "name": "Kadaram Kondan",
    "clues": [
      "Pregnant woman and husband entangled with mysterious man in high-stakes conspiracy.",
      "The gripping chase sequence through crowded streets of Kuala Lumpur.",
      "\"Naan sonna kekkama... ennoda thala ezhutha maaradhu.\"",
      "Rajesh M. Selva",
      "Vikram, Akshara Haasan, Abi Hassan"
    ]
  },
  {
    "name": "Remo",
    "clues": [
      "Struggling actor disguises as female nurse to win doctor's love.",
      "The nurse successfully performs a medical procedure, surprising everyone.",
      "\"Love-ku munnadi, gender kidayadhu.\"",
      "Bakkiaraj Kannan",
      "Sivakarthikeyan, Keerthy Suresh, Saranya Ponvannan"
    ]
  },
  {
    "name": "Irudhi Suttru",
    "clues": [
      "Former boxing champ trains talented female boxer, confronting past demons.",
      "The intense training montages of the heroine's transformation.",
      "\"Perusa porandhutanum nu thevai illa. Perusa sethaalum pothum.\"",
      "Sudha Kongara",
      "R. Madhavan, Ritika Singh, Nassar"
    ]
  },
  {
    "name": "Maanagaram",
    "clues": [
      "Unrelated lives intersect over one night in bustling city; misadventures ensue.",
      "The chaotic climax scene where all characters' paths converge.",
      "\"Chennai dhan idhu, inga edhum impossible illa.\"",
      "Lokesh Kanagaraj",
      "Sri, Sundeep Kishan, Regina Cassandra"
    ]
  },
  {
    "name": "24",
    "clues": [
      "Scientist invents time-traveling watch; evil twin hunts it.",
      "The hero discovers the time-traveling watch and experiments with it.",
      "\"Time is a tricky game.\"",
      "Vikram Kumar",
      "Suriya, Samantha Ruth Prabhu, Nithya Menen"
    ]
  },
  {
    "name": "Jigarthanda",
    "clues": [
      "Filmmaker secretly observes gangster; dark comedy blurs reality and fiction.",
      "The hero first encounters the terrifying and unpredictable gangster.",
      "\"Enna thalaivar? Kalakareenga!\"",
      "Karthik Subbaraj",
      "Siddharth, Bobby Simha, Lakshmi Menon"
    ]
  },
  {
    "name": "Kaithi",
    "clues": [
      "Released prisoner entangled in dangerous mission helping police transport team.",
      "The intense action sequence inside the police station defending officers.",
      "\"Oru naalu porattaiya, oru aayudha thalapathy.\"",
      "Lokesh Kanagaraj",
      "Karthi, Narain, George Maryan"
    ]
  },
  {
    "name": "Sarpatta Parambarai",
    "clues": [
      "Young man from boxing clan fights for community pride and championship.",
      "The climactic boxing match, a triumphant moment for the hero.",
      "\"Boxing na summa illa. Idhu en uyir!\"",
      "Pa. Ranjith",
      "Arya, Dushara Vijayan, Pasupathy"
    ]
  },
  {
    "name": "Karnan",
    "clues": [
      "Young man leads village against oppression, fighting for dignity and justice.",
      "The hero stands up to police with a sword, defending his village.",
      "\"Nenga yaaru nu theriyala... aana inga vanthuttu pona, ungaluku nalla irukkadhu.\"",
      "Mari Selvaraj",
      "Dhanush, Lal, Rajisha Vijayan"
    ]
  },
  {
    "name": "Vikram",
    "clues": [
      "Special agent and team dismantle drug syndicate; explosive action ensues.",
      "The exhilarating climax where the hero assaults the cartel's lair.",
      "\"Ithu aarambam dhan.\"",
      "Lokesh Kanagaraj",
      "Kamal Haasan, Fahadh Faasil, Vijay Sethupathi"
    ]
  },
  {
    "name": "Master",
    "clues": [
      "Irresponsible professor assigned to juvenile facility clashes with dangerous gangster.",
      "The electrifying climax fight between the professor and the gangster.",
      "\"Vaathi coming!\"",
      "Lokesh Kanagaraj",
      "Vijay, Vijay Sethupathi, Malavika Mohanan"
    ]
  }
]